jelly-tags/http/src/test/org/apache/commons/jelly/google/defineTags.jelly

<?xml version="1.0"?>

<!-- 
 ! FIXME: move to define/http taglib
 !-->
<!-- defines a new taglib of babelfish soap services -->

<j:jelly xmlns:j="jelly:core" xmlns:define="jelly:define" xmlns:http="jelly:http">
  <define:taglib uri="jelly:babelfish">  


    <!-- defines the <search> tag  -->
    <define:tag name="search">
      <j:if test="${key == null}">
      	<j:set var="key" value="00000000000"/>
      </j:if>      
      <http:post url="http://www.google.com/soap">
       <http:header name="SOAPAction" value="urn:GoogleSearch"/>
       <http:header name="Content-Type" value="text/xml"/>
       <http:body>
		<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema">
		  <SOAP-ENV:Body>
		    <ns1:doGoogleSearch xmlns:ns1="urn:GoogleSearch" 
		         SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
		      <key xsi:type="xsd:string">${googleKey}</key>
		      <q xsi:type="xsd:string">${query}</q>
		      <start xsi:type="xsd:int">0</start>
		      <maxResults xsi:type="xsd:int">10</maxResults>
		      <filter xsi:type="xsd:boolean">true</filter>
		      <restrict xsi:type="xsd:string"></restrict>
		      <safeSearch xsi:type="xsd:boolean">false</safeSearch>
		      <lr xsi:type="xsd:string"></lr>
		      <ie xsi:type="xsd:string">latin1</ie>
		      <oe xsi:type="xsd:string">latin1</oe>
		    </ns1:doGoogleSearch>
		  </SOAP-ENV:Body>
		</SOAP-ENV:Envelope>
       </http:body>
      </http:post>
    </define:tag>
    
  </define:taglib>    
</j:jelly>
